app/Models/UsersModel.php

    public function getAllUsers()
    {
        $db = \Config\Database::connect();
        return $this->findAll();
---
SELECT *
FROM `users`